//Пользователь вводит с клавиатуры символ. Определить, какой это символ: Буква, цифра, знак препинания или другое.


#include <iostream>

using namespace std;

int main()
{
char symbol;
cout << "Enter a number, letter or symbol - ";
cin >> symbol;
if (symbol >= '0' && symbol <= '9')
    {
        cout << "This is digit";
    }
else if ((symbol >= 'a' && symbol <= 'z') || (symbol >= 'A' && symbol <= 'Z'))
    {
        cout << "This is letter";
    }
else
    {
        cout << "This is sing";
    }
}


// Вася работает программистом и получает 50$ за каждые 100 строк кода. За каждое
//третье опоздание Васю штрафуют на 20$. Реализовать меню:
//- пользователь вводит желаемый доход Васи и количество опозданий, посчитать, сколько строк
//кода ему надо написать
//- пользователь вводит количество строк кода, написанное Васей и желаемый объем зарплаты.
//Посчитать, сколько раз Вася может опоздать
//- пользователь вводит количество строк кода и количество опозданий, определить, сколько
//денег заплатят Васе и заплатят ли вообще

#include <iostream>

using namespace std;

int main()
{
    int string, fine , salary, menu;
    cout << "1 - The user enters the desired income Vasya and the number of delays," << endl;
    cout << "    calculate how many lines of code he needs to write" << endl;
    cout << "2 - The user enters the number of lines of code written by Vasya and the desired amount of salary." << endl;
    cout << "    count how many times Vasya can be late" << endl;
    cout << "3 - The user enters the number of lines of code and the number of delays, determine, " << endl;
    cout << "    how much money Vasya will pay and whether at all." << endl;
    cin >> menu;
    switch (menu)
    {
        case 1:
        {
            cout << "Enter your desired income Vasya, then the number of delays:" << endl;
            cin >> salary;
            cin >> fine;
            string = ((salary - ((fine / 3) * 20)) / 50) * 100;
            cout << "Need to write" << string << " lines of code." << endl;
        }
            break;
        case 2:
        {
            cout << "Enter the number of lines of code written by Vasya and the desired amount of salary:" << endl;
            cin >> string;
            cin >> salary;
            string = (string  / 100) * 50;
            if (salary > string)
            {
                cout << "Vasya can be late 2 times." << endl;
            }
            else if (string > salary)
            {
                fine = ((string - salary)/20)*3;
            }
            cout << "Vasya can be late " << fine << " times." << endl;
        }
            break;
        case 3:
        {
            cout << "Enter the number of lines of code and the number of delays:" << endl;
            cin >> string;
            cin >> fine;
            salary = ((string / 100) * 50) - ((fine / 3) * 20);
            if (salary > 0)
            {
                cout << "Vasya will receive " << salary << " dollars." << endl;
            }
            else
            {
                cout << "Vasya will not receive a salary.";
            }
        }
            break;
        default:
            cout << "Error!" << endl;
    }
}


//Напишите программу, которая вычисляет сумму целых чисел от а до 500 (значение a вводится с клавиатуры)

#include <iostream>

using namespace std;

int main()
{
    int number, sum = 0;
    cout << "Enter number from 1 to 499: ";
    cin >> number;
    if (number > 0 && number < 500)
    {
        for (int i = number; i <= 500; i++)
        {
            int x;
            x = i;
            sum = sum + x;
        }
        cout << "Sum = " << sum;
    } else {
        cout << "Enter correct number";
    }
}

// Напишите программу, которая запрашивает два целых числа x и y, после чего вычисляет и выводит значение x в степени y

#include <iostream>

using namespace std;

int main()
{
    int x, y, z;
    cout << "Enter x: ";
    cin >> x;
    cout << "Enter y: ";
    cin >> y;
    z = x;
    for (int i = 0; i < y-1; i++)
    {
        x = x * z;
    }
    cout << "x to the power of y equals = " << x;
}

//Найти среднее арифметическое всех целых чисел от 1 до 1000.

#include <iostream>

using namespace std;

int main()
{
    double average, sum = 0, x = 0;
    for (int i = 1; i <= 1000; i++)
    {
            x = x + 1;
            sum = sum + x;
    }
average = sum / 1000;
    cout << average;
}

//Найти произведение всех целых чисел от a до 20 (значение a вводится с клавиатуры: 1 <= a <= 20).

#include <iostream>

using namespace std;

int main()
{
    int a, sum;
    cout << "Enter number from 1 to 20: ";
    cin >> a;
    sum = a;
    if (a > 0 && a < 21)
    {
        for (int i = a; i < 20; i++)
        {
            int x;
            x = i+1;
            sum = sum * x;
        }
        cout << "Sum = " << sum;
    }
    else
    {
        cout << "Enter correct number";
    }
}

//Написать программу, которая выводит на экран таблицу умножения на k, где k номер варианта. Например, для 7-го варианта:
// 7 x 2 = 14
// 7 x 3 = 21

#include <iostream>

using namespace std;

int main()
{
    int k;
    cout << "Enter number from 1 to 9: ";
    cin >> k;
    for (int i = 2; i < 10; i++)
    {
        int sum;
        sum = k * i;
        cout << k << " * " << i << " = " << sum << endl;
    }
}
